//
//  5_클래스.cpp
//  CppProject
//
//  Created by 오나현 on 12/18/24.
//

/// 클래스 (Class)

/// C 언어에서는 구조체, 포인터
/// C++ 언어에서는 클래스

/// 객체 지향 프로그래밍 (OOP; Object Oriented Programing)
/// : 실세계의 사물을 추상화(Abstraction)하고,
///   캡슐화(Encapsulation) 하며,
///   계층 구조는 상속(Inheritance)을 시키며,
///   부모와 다른 자식의 특성, 행위는 다형성(Polymophism)으로 구현한다.
/// > 유지보수를 편하게 할 수 있다.

/// 객체(Object) : 물건, 물체
/// 인스턴스(Instance) : 객체의 또다른 표현
/// (예) 클래스를 붕어빵틀(도면)이라고 한다면, 인스턴스는 붕어빵이다.

/// 조금 다른 말이긴 하지만.. C 언어에서 봤던 Struct ==> C++ 언어의 Class 라고 해도 무방하다. (100% 옳은 표현은 아님.)

// --------------------------------------------------

/// 클래스의 원형

